app/Models/Consultas.php

        public function obtenerDatos(){
            //$datos= $this->db->table('t_inventario');
            $builder = $this->db->table('t_inventario');
            $builder->orderBy('familia', 'ASC');
            $builder->orderBy('descripcion', 'ASC');
            return $builder->get()->getResultArray();
---
SELECT *
FROM `t_inventario`
ORDER BY `familia` ASC, `descripcion` ASC

        public function actualizarDatos($id,$setData){
            $builder = $this->db->table('t_inventario');
            $builder->set($setData);
            $builder->where($id);
            $builder->update();
---
UPDATE `t_inventario` SET `existencia` = '0', `diferencia` = '0'
WHERE `codigo` = '998800002400'

        public function getFamilias(){//ya no ocupara, lo datos se actulizaran a travez de un csv
            $builder = $this->db->table('t_inventario');
            $builder->distinct();
            $builder->select('familia');
            $builder->orderBy('familia','ASC');
            return $builder->get()->getResultArray();
---
SELECT DISTINCT `familia`
FROM `t_inventario`
ORDER BY `familia` ASC

        public function selecthistorial($fecha){
            $builder = $this->db->table('t_historial');
            $builder->where('fecha',$fecha);
            return $builder->get()->getResultArray();
---
SELECT *
FROM `t_historial`
WHERE `fecha` = '14-03-2023'

        public function updatealix($codigo,$setData){
            $builder = $this->db->table('t_inventario');
            $builder->set($setData);
            $builder->where('codigo',$codigo);
            $builder->update();
---
UPDATE `t_inventario` SET `existencia` = '339'
WHERE `codigo` = ('998800002390')