app/Models/Usuarios.php

        public function obtenerUsuario($data){
            $Usuario= $this->db->table('t_usuarios');
            $Usuario->where($data);
            return $Usuario->get()->getResultArray();
---
SELECT *
FROM `t_usuarios`
WHERE `usuario` = 'marissa'